# Dispose Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointIterator..::..Dispose Method
PointIterator Class See Also
---
Releases all resources used by the PointIterator
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# See Also
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace